
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Отгрузки.Записывать = Истина;
	Движения.Управленческий.Записывать = Истина;
	
	КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.Валюта)).Курс;
	
	Если Не ЗначениеЗаполнено(КурсВалюты) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлен курс валюты в договоре";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК КоличествоОтправлено,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК СуммаОтправлено,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.КоличествоПолучено) КАК КоличествоПолучено,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.СуммаПолучено) КАК СуммаПолучено
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуммаПолучено = СписокНоменклатуры.Итог("СуммаПолучено");
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Накладная = Ссылка;
		Движение.Сумма = СуммаПолучено;
		
		Движение = Движения.Отгрузки.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = Дата;
		
		Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
		
		Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		
		Движение.СуммаВалДт = СуммаПолучено;
		Движение.СуммаРуб = СуммаПолучено * КурсВалюты;
	КонецЦикла;
	
КонецПроцедуры
